import React from "react";
import "./future.css";

const Future = () => {
  return (
    <div className="future-container">
      <h1>ԱՊԱԳԱՅԻ ՏԵՍԼԱԿԱՆԸ՝ STEM ԿՐԹՈՒԹՅԱՆ ՄԻՋՈՑՈՎ</h1>

      <div className="section_future">
        <img
          src="https://cdn.images.express.co.uk/img/dynamic/151/590x/1348771_1.jpg"
          alt="STEM Future"
        />
        <div>
          <h2>Ինչու է STEM-ը կարևոր ապագայում</h2>
          
            <p>Աշխարհը արագ փոփոխվում է․ տեխնոլոգիաները թափ են առնում։</p>
            <p>Ապագայի աշխատաշուկան պահանջում է STEM գիտելիքներ։</p>
            <p>Կրիտիկական մտածողություն և վերլուծություն՝ 21-րդ դարի հմտություններ։</p>
          
        </div>
      </div>

      <div className="section_future reverse">
        <img
          src="https://insightintoacademia.com/wp-content/uploads/2025/06/Screenshot-2025-06-04-at-3.29.54%E2%80%AFPM.png"
          alt="STEM Professions"
        />
        <div>
          <h2>Ապագայի մասնագիտություններ</h2>
          
            <p>Տվյալագետ (Data Scientist)</p>
            <p>Արհեստական բանականության ինժեներ</p>
            <p>Կիբեռանվտանգության մասնագետ</p>
            <p>Ռոբոտաշինության ինժեներ</p>
            <p>Վիրտուալ իրականության մշակող</p>
          
        </div>
      </div>

      <div className="section_future">
        <img
          src="https://images.unsplash.com/photo-1551434678-e076c223a692?auto=format&fit=crop&w=1186&q=80"
          alt="STEM Collaboration"
        />
        <div>
          <h2>Ինչպիսին պետք է լինի STEM կրթությունը ապագայում</h2>
          
            <p>Աշխատել իրական նախագծերի վրա՝ պրակտիկա և խնդիրների լուծում։</p>
            <p>Ներառել արվեստը՝ STEAM մոտեցում։</p>
            <p>Խթանել համագործակցություն և թիմային ուսուցում։</p>
            <p>Օգտագործել տեխնոլոգիան՝ որպես գործիք, ոչ թե նպատակ։</p>
          
        </div>
      </div>

     <div className="final_section">
      <h2>Եզրակացություն</h2>
        <p>
          STEM կրթությունը ոչ միայն գիտելիքների հաղորդում է, այլև մտածողության մշակույթ։ Այն զարգացնում է տրամաբանական մտածողություն, թիմային աշխատանք, ստեղծագործականություն և հարմարվելու կարողություն՝ փոփոխվող աշխարհին։
        </p>
        <p>
          Ապագայի հասարակության մեջ կհաջողեն նրանք, ովքեր կկարողանան լուծել բարդ խնդիրներ, ստեղծել նոր տեխնոլոգիաներ և աշխատել տարբեր ոլորտների մասնագետների հետ։ Այս ամենի հիմքը դրվում է հենց դպրոցում՝ STEM կրթության միջոցով։
        </p>
        <p>
          Եթե մենք ցանկանում ենք պատրաստել ուժեղ, անկախ և առաջադեմ սերունդ, STEM ներդրումները պետք է սկսվեն հենց այսօր։
        </p>
      </div>

    </div>
  );
};

export default Future;
