import React from 'react';
import './Home.css';

const Home = () => {
  return (
    <div className="home-container">
      <main className="home-main">
        <h1 className="home-title">📚 Բարի գալուստ STEM Աշխարհ</h1>
      <img alt='logo' src='https://embassy.education/wp-content/uploads/2021/03/1.-STEM-education-reasons.jpg'/>
      <div className='home-container-content'>
           <p>
          Բնագիտություն, տեխնիկա, ճարտարագիտություն և մաթեմատիկա՝ այս չորս ուղղությունները համատեղ հայտնի են որպես STEM։
          Մեր առջև բացվում է ապագայի մի հորիզոն, որտեղ նորարարությունը, ստեղծագործությունը և վերլուծական մտածողությունը դառնում են ամենակարևոր հմտությունները։
          Այս կայքը նպատակ ունի հարթակ հանդիսանալ սովորողների, ուսուցիչների և հետաքրքրված անձանց համար, ովքեր ցանկանում են զարգանալ այս ոլորտներում։
        </p>
          <p>
          STEM-ը պարզապես ուսում չէ — այն մտածելու ձև է։ Այն սովորեցնում է մեզ տեսնել խնդիրները որպես հնարավորություններ, մոտենալ կյանքին վերլուծական հայացքով և վստահ քայլել դեպի անորոշ ապագա՝ գիտելիքով զինված։
        </p>
      </div>
     

      
<div className='what-find-content'>
    <h2>🔬 Մեր կայքում դուք կարող եք՝</h2>
        <ul>
          <li>Ուսումնասիրել բնագիտության հրաշալի աշխարհը՝ սկսած մոլեկուլներից մինչև գալակտիկաներ</li>
          <li>Ծանոթանալ տեխնոլոգիաների վերջին զարգացումներին՝ արհեստական բանականությունից մինչև ռոբոտաշինություն</li>
          <li>Սովորել ինժեներական մտածելակերպ՝ նախագծել, ստեղծել, փորձարկել</li>
          <li>Ամրապնդել մաթեմատիկական հիմքը՝ թվերի ուժով լուծել բարդագույն խնդիրներ</li>
        </ul>

        <p>
          Արդյո՞ք STEM-ը քեզ համար է։<br />
          Եթե երբևէ հարց ես տվել՝ «Ինչո՞ւ է երկինքը կապույտ» կամ փորձել ես ինքնուրույն ինչ-որ բան սարքել, դա արդեն նշանակում է, որ քո մեջ ապրում է գիտնական կամ ինժեներ։
          STEM-ը օգնում է այդ հետաքրքրասիրությունը վերածել գիտելիքի և հաջողության։
        </p>

        <p>
          Ճշգրիտ և բնական գիտությունները փոխում են աշխարհը։ Դրանք թույլ են տալիս ոչ միայն հասկանալ, այլև փոխել իրականությունը։
          Սովորիր մեզ հետ, զարգացրու հմտություններդ և պատրաստվիր մի աշխարհում աշխատելու, որտեղ փոփոխությունը անընդհատ է, և գիտելիքը՝ ամենաթանկ ռեսուրսը։
        </p>

        <p className="home-highlight">
          🌟 Մեր նպատակն է՝ ոգեշնչել քեզ սովորել, ստեղծել և կիսվել քո գաղափարներով STEM համայնքում։
          Միացիր մեզ այսօր՝ որպես ապագայի առաջնորդ։
        </p>
</div>
    
      </main>
    </div>
  );
};

export default Home;
